1 : Job ID af823d2a4cb541d2baaa9cce72b11aa9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a - b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True

2 : Job ID 4b5ed728040444988af7b027615bac07
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a - c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True

3 : Job ID d285556bee0b4846946d94128a561b25
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_Sub, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b - c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True

4 : Job ID e9a573dc7f464f96b9de6fd191491c9e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a * b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F.....FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = True

5 : Job ID b7dca9b8ab834809a27bac96da3ed599
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a * c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True

6 : Job ID 0c208200b0d943f2941629ff78880ed6
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_Mul, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b * c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True

7 : Job ID 6cfb74cea7f5491e84f984e58277c832
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a / b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True

8 : Job ID dff411627eba4f65a840f711bbe3ed8d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a / c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True

9 : Job ID 89e37349170641eab463766023a1694d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_Div, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b / c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True

10 : Job ID a73da6e4d5ad4c758526085807c42c58
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a // b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0

11 : Job ID 87e4265352e1492b9a6e4953620d4810
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a // c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0

12 : Job ID 5eaccfe2a57a431595c4a67d3b110433
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_FloorDiv, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b // c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0

13 : Job ID 719d929bca21482690ae174116c2e520
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a % b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True

14 : Job ID f099e6a4e45d4edf9f4d5a26b22e16f3
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a % c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = Tru

15 : Job ID 7ad9cb50610747ac83c6f44cf8365398
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_Mod, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b % c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = Tru

16 : Job ID 7ec440860e264f97bd94fe0b4b6dcd7b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a ** b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F.....FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = Tru

17 : Job ID 3cf4a39f967a44e39828f376cb8e70b2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a ** c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = Tr

18 : Job ID f739541f88ef4cf8a53481fe4d3dc4f9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_Pow, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b ** c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = Tr

19 : Job ID d4442ab6db554168b7d7d797bc9540dd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a >> b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 =
