20 : Job ID 82e4285337c844f7bf9cd757fb1e4077
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a >> c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 =

21 : Job ID 08aaac1d37374efe89f451beb90807c6
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_RShift, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b >> c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 =

22 : Job ID 983a2465bee440a5801532edb6459eda
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a << b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

23 : Job ID 223076fbe5f7497b8ec3e0af2206cc0b
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a << c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

24 : Job ID 044a5da073f6446d8dad6c2ead55e654
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_LShift, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b << c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

25 : Job ID 5bb9497089e74c89bf57836d3436c9b4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a | b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F......F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = Tr

26 : Job ID 5985f5e53e3b4a5caa747530a5c40423
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a | c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = T

27 : Job ID 82e498dc3b0c4f7c9dbe3d01ce2c384d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_BitOr, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b | c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = T

28 : Job ID 16b18344d67740388db063f59942468d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a & b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F.....FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = T

29 : Job ID 571d0fc4824a4ed3a1f4e2c10c0979fd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a & c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 =

30 : Job ID 55f13c85a32d4a06ab1a954f99176e2b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_BitAnd, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b & c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 =

31 : Job ID 10a10155335443f3bf5eb9a42b151ca5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 9), end pos: (4, 10)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a ^ b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = T

32 : Job ID 7846977ac13945d2960a2e9ce38a0786
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 23), end pos: (4, 24)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a ^ c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 =

33 : Job ID 033f6d6115104e8c8213fd6def7f76e8
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 37), end pos: (4, 38)
operator: core/ReplaceBinaryOperator_Add_BitXor, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b ^ c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 =

34 : Job ID 513744f9e8ff49269e82cf03a8dca4db
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 9), end pos: (6, 11)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a != b == c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F......F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Isosceles' == 'Equilateral'
E         
E         - Equilateral
E         + Isosceles
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = True
        int_0 = 3887
        var_0

35 : Job ID 9458e5868fbc421fabefc1b2da35adb7
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 14), end pos: (6, 16)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a == b != c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Isosceles' == 'Equilateral'
E         
E         - Equilateral
E         + Isosceles
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_

36 : Job ID d7c3818eacb04617bed4e5fc9b9201e0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 11), end pos: (8, 13)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a != b or b == c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ....FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
        assert var_0 == "Not a Triangle"
        var_1 = module_0.classify_triangle(int_0, int_0, bool_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:41: AssertionError
_________________________________ test_case_5 _________________

37 : Job ID bb2edc6aba9d46f9a07b6c0cb231f529
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 21), end pos: (8, 23)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b != c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ........F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = True
        int_0 = 3887
        var_0 = module_0.classify_triangle(int_0, int_0, bool_0)
        assert var_0 == "Isosceles"
        var_1 = module_0.classify_triangle(bool_0, int_0, int_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:74: AssertionError
================================ tests coverage =====================

38 : Job ID c7d223bdeb6e4bfa8b41208eb7acd4b4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 31), end pos: (8, 33)
operator: core/ReplaceComparisonOperator_Eq_NotEq, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b == c or a != c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .......F.                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = True
        int_0 = 3900
        var_0 = module_0.classify_triangle(int_0, bool_0, int_0)
>       assert var_0 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:65: AssertionError
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage

39 : Job ID e205778188904111b33ac4a1d9a43c6d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 9), end pos: (6, 11)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a < b == c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F......F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Isosceles' == 'Equilateral'
E         
E         - Equilateral
E         + Isosceles
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = True
        int_0 = 3887
        var_0 = m
