40 : Job ID 767910d2c87a43bc84902b1989302a1e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 14), end pos: (6, 16)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a == b < c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F.......                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Isosceles' == 'Equilateral'
E         
E         - Equilateral
E         + Isosceles
tests/test_triangle.py:18: AssertionError
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
C

41 : Job ID ffbd81846cea48788a66020f564fbe3c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 11), end pos: (8, 13)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a < b or b == c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ....FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
        assert var_0 == "Not a Triangle"
        var_1 = module_0.classify_triangle(int_0, int_0, bool_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:41: AssertionError
_________________________________ test_case_5 _____________________

42 : Job ID fef86b36187f454698798b134426322c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 21), end pos: (8, 23)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b < c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ........F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = True
        int_0 = 3887
        var_0 = module_0.classify_triangle(int_0, int_0, bool_0)
        assert var_0 == "Isosceles"
        var_1 = module_0.classify_triangle(bool_0, int_0, int_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:74: AssertionError
================================ tests coverage =========================

43 : Job ID 251b2082f01d457ba0e0d35110d28b52
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 31), end pos: (8, 33)
operator: core/ReplaceComparisonOperator_Eq_Lt, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b == c or a < c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .......F.                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = True
        int_0 = 3900
        var_0 = module_0.classify_triangle(int_0, bool_0, int_0)
>       assert var_0 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:65: AssertionError
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTM

44 : Job ID e6646974969c490180a61e352d917b50
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 9), end pos: (6, 11)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a <= b == c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ........F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = True
        int_0 = 3887
        var_0 = module_0.classify_triangle(int_0, int_0, bool_0)
        assert var_0 == "Isosceles"
        var_1 = module_0.classify_triangle(bool_0, int_0, int_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Equilateral' == 'Isosceles'
E         
E         - Isosceles
E         + Equilateral
tests/test_triangle.py:74: AssertionError
================================ tests cover

45 : Job ID 535e61b9ad5e471dabe1693733a245ed
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (6, 14), end pos: (6, 16)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a == b <= c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

46 : Job ID 33b12957b63e43d291ec3446a6c94d80
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (8, 11), end pos: (8, 13)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a <= b or b == c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

47 : Job ID 13adda2a79b646cf97767a40429bd4e5
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (8, 21), end pos: (8, 23)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b <= c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

48 : Job ID e50335c6e71942a3ad058ae191e84fb9
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (8, 31), end pos: (8, 33)
operator: core/ReplaceComparisonOperator_Eq_LtE, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b == c or a <= c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

49 : Job ID 714423c86cf54089a66961ff0bf638f9
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 9), end pos: (6, 11)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a > b == c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F.......                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Isosceles' == 'Equilateral'
E         
E         - Equilateral
E         + Isosceles
tests/test_triangle.py:18: AssertionError
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Co

50 : Job ID 7a5e6a68ac3a491284fb07b50ae45a31
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 14), end pos: (6, 16)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a == b > c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Isosceles' == 'Equilateral'
E         
E         - Equilateral
E         + Isosceles
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 =

51 : Job ID 9f396f62dfe447caa1c1c62ffddc47d2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 11), end pos: (8, 13)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a > b or b == c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ....FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
        assert var_0 == "Not a Triangle"
        var_1 = module_0.classify_triangle(int_0, int_0, bool_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:41: AssertionError
_________________________________ test_case_5 _____________________

52 : Job ID 881c2af226bd41c78a2a99da9d6eaf75
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 21), end pos: (8, 23)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b > c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ........F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = True
        int_0 = 3887
        var_0 = module_0.classify_triangle(int_0, int_0, bool_0)
        assert var_0 == "Isosceles"
        var_1 = module_0.classify_triangle(bool_0, int_0, int_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:74: AssertionError
================================ tests coverage =========================

53 : Job ID dd3cfaef8a20431fa5549e8c5f78c188
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 31), end pos: (8, 33)
operator: core/ReplaceComparisonOperator_Eq_Gt, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b == c or a > c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .......F.                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = True
        int_0 = 3900
        var_0 = module_0.classify_triangle(int_0, bool_0, int_0)
>       assert var_0 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:65: AssertionError
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTM

54 : Job ID 7eaf89a756124baf895f12fbc7f71e9c
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (6, 9), end pos: (6, 11)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a >= b == c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

55 : Job ID 1c3fb2b8db4d49a6aecd8ced860571ad
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 14), end pos: (6, 16)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a == b >= c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ....FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
        assert var_0 == "Not a Triangle"
        var_1 = module_0.classify_triangle(int_0, int_0, bool_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Equilateral' == 'Isosceles'
E         
E         - Isosceles
E         + Equilateral
tests/test_triangle.py:41: AssertionError
_________________________________ tes

56 : Job ID f6dbe2f38af74080a983ac82a7353983
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (8, 11), end pos: (8, 13)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a >= b or b == c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

57 : Job ID b51e5036c35b442b9af672ee22401a2b
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (8, 21), end pos: (8, 23)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b >= c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

58 : Job ID a32375c7002b4443aecf7dbb2135854b
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (8, 31), end pos: (8, 33)
operator: core/ReplaceComparisonOperator_Eq_GtE, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b == c or a >= c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

59 : Job ID 9ea4a1ee36b444cebc4148e58d3c4ebc
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (6, 9), end pos: (6, 11)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a is b == c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

60 : Job ID 72cea4b1494843f88748a686a4952b9f
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (6, 14), end pos: (6, 16)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a == b is c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

61 : Job ID 27a3a42c37374d9a85c5dd9a6365feb0
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (8, 11), end pos: (8, 13)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a is b or b == c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================
