62 : Job ID 564801591dd341d2acb6ac009feba2f3
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (8, 21), end pos: (8, 23)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b is c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

63 : Job ID 970e82e1bb5e4261ba9ba46917ea837b
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (8, 31), end pos: (8, 33)
operator: core/ReplaceComparisonOperator_Eq_Is, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b == c or a is c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

64 : Job ID 52d9d91045f24b399dabe026c7b716dc
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 9), end pos: (6, 11)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a is not b == c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F......F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Isosceles' == 'Equilateral'
E         
E         - Equilateral
E         + Isosceles
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = True
        int_0 = 3887
        v

65 : Job ID fd43caf807b140ce9b81a7f52cd1ad99
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 14), end pos: (6, 16)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if a == b is not c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Isosceles' == 'Equilateral'
E         
E         - Equilateral
E         + Isosceles
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905

66 : Job ID f6058ec2492c46c9aeb33db92f14a127
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 11), end pos: (8, 13)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a is not b or b == c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ....FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
        assert var_0 == "Not a Triangle"
        var_1 = module_0.classify_triangle(int_0, int_0, bool_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:41: AssertionError
_________________________________ test_case_5 _____________

67 : Job ID e56ef0fe1ce24b3a95bde8061093b14e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 21), end pos: (8, 23)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b is not c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ........F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = True
        int_0 = 3887
        var_0 = module_0.classify_triangle(int_0, int_0, bool_0)
        assert var_0 == "Isosceles"
        var_1 = module_0.classify_triangle(bool_0, int_0, int_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:74: AssertionError
================================ tests coverage =================

68 : Job ID fcac0f58382442adbe02e6e149cbde6c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 31), end pos: (8, 33)
operator: core/ReplaceComparisonOperator_Eq_IsNot, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b == c or a is not c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .......F.                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = True
        int_0 = 3900
        var_0 = module_0.classify_triangle(int_0, bool_0, int_0)
>       assert var_0 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:65: AssertionError
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Cove

69 : Job ID d4bec21ecb624e81b9c30afc09c2d06a
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (2, 9), end pos: (2, 11)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a == 0 or b <= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

70 : Job ID 7d24296ceb684199b0fa9f4cc2001530
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (2, 19), end pos: (2, 21)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b == 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

71 : Job ID b1516ac18f344c2f81b54a2a8a97d232
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (2, 29), end pos: (2, 31)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= 0 or c == 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

72 : Job ID 56e87ee361cc411e97d29bf5fd0fa16f
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 13), end pos: (4, 15)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b == c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ..F......                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(bool_0, bool_0, float_0)
>       assert var_0 == "Not a Triangle"
E       AssertionError: assert 'Isosceles' == 'Not a Triangle'
E         
E         - Not a Triangle
E         + Isosceles
tests/test_triangle.py:25: AssertionError
================================ tests coverage ================================
_____________

73 : Job ID 0c0e6dd9bef0422591d44e0e6133a40b
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 27), end pos: (4, 29)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c == b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ....F....                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
>       assert var_0 == "Not a Triangle"
E       AssertionError: assert 'Isosceles' == 'Not a Triangle'
E         
E         - Not a Triangle
E         + Isosceles
tests/test_triangle.py:39: AssertionError
================================ tests coverage ================================
_______________ cover

74 : Job ID 31e3ba597cbf4c73b1494094bc264815
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 41), end pos: (4, 43)
operator: core/ReplaceComparisonOperator_LtE_Eq, occurrence: 5, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b + c == a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ......F..                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(int_0, bool_0, bool_0)
>       assert var_0 == "Not a Triangle"
E       AssertionError: assert 'Isosceles' == 'Not a Triangle'
E         
E         - Not a Triangle
E         + Isosceles
tests/test_triangle.py:58: AssertionError
================================ tests coverage ================================
_______________ cover

75 : Job ID fc87a34b4bd842ffae08a5b85eef980e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 9), end pos: (2, 11)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a != 0 or b <= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(

76 : Job ID ebd582b16df8465cb44f9a3942f13a66
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 19), end pos: (2, 21)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b != 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FFFFFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle

77 : Job ID 8e90fa88d1ec4e7c80a0e2ed6cb34cb2
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 29), end pos: (2, 31)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= 0 or c != 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py FFF.FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        bool_0 = False
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
        assert var_0 == "Invalid"
        bool_1 = True
        var_1 = module_0.classify_triangle(bool_1, bool_1, bool_0)
>       assert var_1 == "Invalid"
E       AssertionError: assert 'Not a Triangle' == 'Invalid'
E         
E         - Invalid
E         + Not a Triangle
tests/test_triangle.py:12: AssertionError
_________________________________ test_case_1 _______________________

78 : Job ID dcdb0347c57f4446b98eb9ad56c074ae
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 13), end pos: (4, 15)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b != c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0

79 : Job ID 66c957b142444844a0c5b7a39255e79a
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 27), end pos: (4, 29)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c != b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0

80 : Job ID 38437c6f521b4e37855293a4109b700e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 41), end pos: (4, 43)
operator: core/ReplaceComparisonOperator_LtE_NotEq, occurrence: 5, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b + c != a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0

81 : Job ID 4e2ad44f483746ecb758608583ecdc53
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (2, 9), end pos: (2, 11)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a < 0 or b <= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

82 : Job ID 6a53830aad13487098e7bf729adbed4c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 19), end pos: (2, 21)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b < 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ...F.....                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        bool_0 = True
        bool_1 = False
        var_0 = module_0.classify_triangle(bool_0, bool_1, bool_0)
>       assert var_0 == "Invalid"
E       AssertionError: assert 'Not a Triangle' == 'Invalid'
E         
E         - Invalid
E         + Not a Triangle
tests/test_triangle.py:32: AssertionError
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTM
