83 : Job ID df98b6ab17724ca9a900b7d9709fbc64
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 29), end pos: (2, 31)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= 0 or c < 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py F........                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        bool_0 = False
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
        assert var_0 == "Invalid"
        bool_1 = True
        var_1 = module_0.classify_triangle(bool_1, bool_1, bool_0)
>       assert var_1 == "Invalid"
E       AssertionError: assert 'Not a Triangle' == 'Invalid'
E         
E         - Invalid
E         + Not a Triangle
tests/test_triangle.py:12: AssertionError
================================ tests coverage =========================

84 : Job ID fcf92c3cc2f744eda39115b0f8ee5c70
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (4, 13), end pos: (4, 15)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b < c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.05s ===============================

85 : Job ID 471af91a5c9a4c5ba387481836e556b3
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (4, 27), end pos: (4, 29)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c < b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

86 : Job ID 794fa7beaeac4e9ebf4f9bdcc1c4c555
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (4, 41), end pos: (4, 43)
operator: core/ReplaceComparisonOperator_LtE_Lt, occurrence: 5, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b + c < a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

87 : Job ID ec5ca397394e4306a610483cd7411f78
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 9), end pos: (2, 11)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a > 0 or b <= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(bool

88 : Job ID 90d6abf98d82446fac40b26fc2740685
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 19), end pos: (2, 21)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b > 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FFFFFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(boo

89 : Job ID 90581e4fae874fc185b9fbe5eda297cd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 29), end pos: (2, 31)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= 0 or c > 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py FFF.FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        bool_0 = False
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
        assert var_0 == "Invalid"
        bool_1 = True
        var_1 = module_0.classify_triangle(bool_1, bool_1, bool_0)
>       assert var_1 == "Invalid"
E       AssertionError: assert 'Not a Triangle' == 'Invalid'
E         
E         - Invalid
E         + Not a Triangle
tests/test_triangle.py:12: AssertionError
_________________________________ test_case_1 ___________________________

90 : Job ID 2c894d1043174bbc94389ddb1a7137e4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 13), end pos: (4, 15)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b > c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = T

91 : Job ID d5a6ddcca04d460f85eeaa9418300643
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 27), end pos: (4, 29)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c > b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = T

92 : Job ID c612f6c7889d4b42b48905ecc778f3b0
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 41), end pos: (4, 43)
operator: core/ReplaceComparisonOperator_LtE_Gt, occurrence: 5, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b + c > a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = T

93 : Job ID 4102cdfd7b974875a21b59e016fc090c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 9), end pos: (2, 11)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a >= 0 or b <= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(bo

94 : Job ID d2b9dce0fc354f1c80b04d3769b67926
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 19), end pos: (2, 21)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b >= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(b

95 : Job ID e9127590d4ca4d43a156d5749c3eeecd
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 29), end pos: (2, 31)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= 0 or c >= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(b

96 : Job ID 7979f03ee09f439e87eeef0266822716
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 13), end pos: (4, 15)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b >= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 =

97 : Job ID ee4c23b76b044a91abe266297238e0ca
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 27), end pos: (4, 29)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c >= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 =

98 : Job ID 4713f871f0784a31b8cec4236283f685
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 41), end pos: (4, 43)
operator: core/ReplaceComparisonOperator_LtE_GtE, occurrence: 5, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b + c >= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 =

99 : Job ID f9d22b8199c54063a2f2cca7975ac399
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 13), end pos: (4, 15)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b is c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ..F......                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(bool_0, bool_0, float_0)
>       assert var_0 == "Not a Triangle"
E       AssertionError: assert 'Isosceles' == 'Not a Triangle'
E         
E         - Not a Triangle
E         + Isosceles
tests/test_triangle.py:25: AssertionError
================================ tests coverage ================================
_____________

100 : Job ID c0b98fa12e7948958f977104cd9764bf
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 27), end pos: (4, 29)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c is b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ....F....                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
>       assert var_0 == "Not a Triangle"
E       AssertionError: assert 'Isosceles' == 'Not a Triangle'
E         
E         - Not a Triangle
E         + Isosceles
tests/test_triangle.py:39: AssertionError
================================ tests coverage ================================
_______________ cove

101 : Job ID 04be08c6dc5940c9aed24ad29faf7fa5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 41), end pos: (4, 43)
operator: core/ReplaceComparisonOperator_LtE_Is, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b + c is a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ......F..                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_6 __________________________________
    def test_case_6():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(int_0, bool_0, bool_0)
>       assert var_0 == "Not a Triangle"
E       AssertionError: assert 'Isosceles' == 'Not a Triangle'
E         
E         - Not a Triangle
E         + Isosceles
tests/test_triangle.py:58: AssertionError
================================ tests coverage ================================
_______________ cove

102 : Job ID 741c3c027cb84508a1593c414bae0b37
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 13), end pos: (4, 15)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b is not c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        b
