103 : Job ID 304e000c6348477a93354aa05ebde4cf
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 27), end pos: (4, 29)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c is not b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        b

104 : Job ID e29445609147425e9925101cab123f6d
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 41), end pos: (4, 43)
operator: core/ReplaceComparisonOperator_LtE_IsNot, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b or b + c is not a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        b

105 : Job ID 091fd1bf5ad5417aa4a6fb8d2dcace04
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 7), end pos: (2, 33)
operator: core/AddNot, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if not a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.FFFFF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(bool_0, bool_0, float_0)

106 : Job ID e687238c8cac484d93b1bb9a3b0e6275
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 7), end pos: (4, 45)
operator: core/AddNot, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if not a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Not a Triangle' == 'Equilateral'
E         
E         - Equilateral
E         + Not a Triangle
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 =

107 : Job ID 5aaa9d5c060040ff9777120ac1a61b1c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (6, 7), end pos: (6, 18)
operator: core/AddNot, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -3,7 +3,7 @@
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
-    if a == b == c:
+    if not a == b == c:
         return "Equilateral"
     elif a == b or b == c or a == c:
         return "Isosceles"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FF.FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Isosceles' == 'Equilateral'
E         
E         - Equilateral
E         + Isosceles
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_tr

108 : Job ID 1b6b3452da2f4d0982ed9c146b8a3e1c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 14), end pos: (2, 16)
operator: core/ReplaceOrWithAnd, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 and b <= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ...F.....                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        bool_0 = True
        bool_1 = False
        var_0 = module_0.classify_triangle(bool_0, bool_1, bool_0)
>       assert var_0 == "Invalid"
E       AssertionError: assert 'Not a Triangle' == 'Invalid'
E         
E         - Invalid
E         + Not a Triangle
tests/test_triangle.py:32: AssertionError
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to

109 : Job ID 6475ab330cb04c7d862be332aea091da
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 24), end pos: (2, 26)
operator: core/ReplaceOrWithAnd, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= 0 and c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py F..F.....                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        bool_0 = False
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
        assert var_0 == "Invalid"
        bool_1 = True
        var_1 = module_0.classify_triangle(bool_1, bool_1, bool_0)
>       assert var_1 == "Invalid"
E       AssertionError: assert 'Not a Triangle' == 'Invalid'
E         
E         - Invalid
E         + Not a Triangle
tests/test_triangle.py:12: AssertionError
_________________________________ test_case_3 __________________________________
    d

110 : Job ID d6ef4688ff5841a49f7af8bf0f07dcfb
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 18), end pos: (4, 20)
operator: core/ReplaceOrWithAnd, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c and a + c <= b or b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ..F.F....                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(bool_0, bool_0, float_0)
>       assert var_0 == "Not a Triangle"
E       AssertionError: assert 'Isosceles' == 'Not a Triangle'
E         
E         - Not a Triangle
E         + Isosceles
tests/test_triangle.py:25: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():

111 : Job ID b2bb9120f54f46859dfe196f9c3d611c
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (4, 32), end pos: (4, 34)
operator: core/ReplaceOrWithAnd, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,7 +1,7 @@
 def classify_triangle(a, b, c):
     if a <= 0 or b <= 0 or c <= 0:
         return "Invalid"
-    if a + b <= c or a + c <= b or b + c <= a:
+    if a + b <= c or a + c <= b and b + c <= a:
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ....F.F..                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
>       assert var_0 == "Not a Triangle"
E       AssertionError: assert 'Isosceles' == 'Not a Triangle'
E         
E         - Not a Triangle
E         + Isosceles
tests/test_triangle.py:39: AssertionError
_________________________________ test_case_6 __________________________________
    def test_case_6():
        bool

112 : Job ID 54cf704518e74ee7a5cef84ac23112d4
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 16), end pos: (8, 18)
operator: core/ReplaceOrWithAnd, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b and b == c or a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ....FF..F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
        assert var_0 == "Not a Triangle"
        var_1 = module_0.classify_triangle(int_0, int_0, bool_0)
>       assert var_1 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:41: AssertionError
_________________________________ test_case_5 _________________________________

113 : Job ID e296034b64bb4d75b53b7c740b5cb364
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (8, 26), end pos: (8, 28)
operator: core/ReplaceOrWithAnd, occurrence: 5, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -5,7 +5,7 @@
         return "Not a Triangle"
     if a == b == c:
         return "Equilateral"
-    elif a == b or b == c or a == c:
+    elif a == b or b == c and a == c:
         return "Isosceles"
     else:
         return "Scalene"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .......FF                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_7 __________________________________
    def test_case_7():
        bool_0 = True
        int_0 = 3900
        var_0 = module_0.classify_triangle(int_0, bool_0, int_0)
>       assert var_0 == "Isosceles"
E       AssertionError: assert 'Scalene' == 'Isosceles'
E         
E         - Isosceles
E         + Scalene
tests/test_triangle.py:65: AssertionError
_________________________________ test_case_8 __________________________________
    def test_case_8():
        bool_0 = True
        int_0 = 3887
        var_0 = module_0.classify_trian

114 : Job ID fabc17b4075f40af9b7b91ddeaf5b26e
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 12), end pos: (2, 13)
operator: core/NumberReplacer, occurrence: 0, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 1 or b <= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF.F...F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(bool_0, bool_0, flo

115 : Job ID f172a2ad56dc48ce907bface2bb87354
SURVIVED
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.SURVIVED
benchmark/triangle.py, start pos: (2, 12), end pos: (2, 13)
operator: core/NumberReplacer, occurrence: 1, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= -1 or b <= 0 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .........                                         [100%]
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to dir results/pynguin/htmlcov
============================== 9 passed in 0.04s ===============================

116 : Job ID 8788b9de5c294d73a204a463af7fa0e1
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 22), end pos: (2, 23)
operator: core/NumberReplacer, occurrence: 2, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= 1 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .FF...FF.                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_2 __________________________________
    def test_case_2():
        bool_0 = True
        float_0 = 1267.706
        var_0 = module_0.classify_triangle(bool_0, bool_0, flo

117 : Job ID a8b872b100344823b0fc0c8a0b0b72a5
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 22), end pos: (2, 23)
operator: core/NumberReplacer, occurrence: 3, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= -1 or c <= 0:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py ...F.....                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_3 __________________________________
    def test_case_3():
        bool_0 = True
        bool_1 = False
        var_0 = module_0.classify_triangle(bool_0, bool_1, bool_0)
>       assert var_0 == "Invalid"
E       AssertionError: assert 'Not a Triangle' == 'Invalid'
E         
E         - Invalid
E         + Not a Triangle
tests/test_triangle.py:32: AssertionError
================================ tests coverage ================================
_______________ coverage: platform linux, python 3.12.3-final-0 ________________
Coverage HTML written to di

118 : Job ID 7aca02547f3040568db49677bd22d0ff
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 32), end pos: (2, 33)
operator: core/NumberReplacer, occurrence: 4, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= 0 or c <= 1:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py .F..FFF.F                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_1 __________________________________
    def test_case_1():
        bool_0 = True
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
>       assert var_0 == "Equilateral"
E       AssertionError: assert 'Invalid' == 'Equilateral'
E         
E         - Equilateral
E         + Invalid
tests/test_triangle.py:18: AssertionError
_________________________________ test_case_4 __________________________________
    def test_case_4():
        bool_0 = True
        int_0 = 3905
        var_0 = module_0.classify_triangle(bool_0, int_0, bool_0)
>

119 : Job ID 1fa7ac9b007c48e7bd4ac5088391e247
worker outcome: WorkerOutcome.NORMAL
test outcome: TestOutcome.KILLED
benchmark/triangle.py, start pos: (2, 32), end pos: (2, 33)
operator: core/NumberReplacer, occurrence: 5, definition_name: classify_triangle
--- mutation diff ---
--- abenchmark/triangle.py
+++ bbenchmark/triangle.py
@@ -1,5 +1,5 @@
 def classify_triangle(a, b, c):
-    if a <= 0 or b <= 0 or c <= 0:
+    if a <= 0 or b <= 0 or c <= -1:
         return "Invalid"
     if a + b <= c or a + c <= b or b + c <= a:
         return "Not a Triangle"
benchmark: 5.2.3 (defaults: timer=time.perf_counter disable_gc=False min_rounds=5 min_time=0.000005 max_time=1.0 calibration_precision=10 warmup=False warmup_iterations=100000)
tests/test_triangle.py F........                                         [100%]
=================================== FAILURES ===================================
_________________________________ test_case_0 __________________________________
    def test_case_0():
        bool_0 = False
        var_0 = module_0.classify_triangle(bool_0, bool_0, bool_0)
        assert var_0 == "Invalid"
        bool_1 = True
        var_1 = module_0.classify_triangle(bool_1, bool_1, bool_0)
>       assert var_1 == "Invalid"
E       AssertionError: assert 'Not a Triangle' == 'Invalid'
E         
E         - Invalid
E         + Not a Triangle
tests/test_triangle.py:12: AssertionError
================================ tests coverage ================================
_______
